In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

# Nan Values

NaN = Not-a-Number

np.nan, belirsiz veya tanımlanamaz sayısal değerleri temsil etmek için kullanılır.

np.nan değeri, "sentinel" bir değer olarak kabul edilir ve herhangi bir değerle, hatta kendisiyle bile karşılaştırılamaz.

Sentinel; matematiksel hesaplamalarda belirsiz veya tanımlanamaz değerleri temsil etmek için kullanılır. 

None; sentinel bir değerdir ve bir fonksiyonun veya metodun "boş" veya "tanımsız" bir değeri ifade etmesi için kullanılır. 

Sütunun data tipi object ise "nan", sayısal ise "NaN" olur.

[SOURCE01](https://www.educative.io/edpresso/what-is-the-none-keyword-in-python), 
[SOURCE02](https://stackoverflow.com/questions/21095654/what-is-a-nonetype-object),
[SOURCE03](https://www.skytowner.com/explore/difference_between_none_and_nan_in_pandas), 
[SOURCE04](https://kegui.medium.com/what-is-the-difference-between-nan-none-pd-nan-and-np-nan-a8ee0532e2eb),
[SOURCE05](https://stackoverflow.com/questions/53436339/difference-between-np-nan-and-np-nan),
[SOURCE06](https://stackoverflow.com/questions/40309789/difference-between-nan-and-nan-in-python),
[SOURCE07](https://towardsdatascience.com/navigating-the-hell-of-nans-in-python-71b12558895b)

In [2]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", None, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, None, 136, 60, 125, np.nan])

df0 = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "var1" : V1,
                   "var2" : V2,
                   "salary" : salary
                  })
df = df0.copy() # original veriyi korumuş olduk
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [3]:
type(df.iloc[0, 4]) # var1 sütunundaki nan yazan hücreler str'dir
# eğer dataframede NaN şeklinde yazılı değilse str' dir

str

In [4]:
type(df.iloc[3, 4])

str

In [5]:
type(df.iloc[5, 5])

numpy.float64

In [6]:
df.info() # var1 de str değer olduğu için nan ları göremedi

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      object
dtypes: float64(1), object(6)
memory usage: 744.0+ bytes

In [7]:
type(np.nan)

float

In [8]:
type(np.NaN)

float

In [9]:
type(None)

NoneType

In [10]:
a = pd.Series([1, np.nan, np.NaN, None, 2])
print(a)
a.isnull().sum()

0    1.0
1    NaN
2    NaN
3    NaN
4    2.0
dtype: float64

3

In [11]:
b = pd.Series([1, "nan", "nan", 3, 2, "-"])
print(b)
b.isnull().sum()

0      1
1    nan
2    nan
3      3
4      2
5      -
dtype: object

0

In [12]:
print("1", 0 * np.NaN)
print("2", np.nan - np.nan)
print("3", np.nan + np.nan)
print("4", np.nan - 10)
print("5", np.nan + 10)
print("6", np.nan == np.nan) 
print("7", 10 > np.nan)
print("8", np.inf > np.nan) #np.inf sonsuz demek
print("9", float('-inf') < np.nan < float('inf'))
print("10", np.nan is np.nan)

1 nan
2 nan
3 nan
4 nan
5 nan
6 False
7 False
8 False
9 False
10 True

In [13]:
pd.DataFrame([[np.nan, 1], [np.NaN, 2]])

    0  1
0 NaN  1
1 NaN  2

In [14]:
np.array([[np.nan, 1], [np.nan, 2]])

array([[nan,  1.],
       [nan,  2.]])

## .isnull() & .isna() & .notnull()

In [15]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [16]:
df.isnull()

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [17]:
df.isna()

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [18]:
df.notnull()

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [19]:
df.isnull().any() # sütun sütun baktı ve null var mı diye sordu

id        False
gender    False
status     True
dept       True
var1      False
var2       True
salary     True
dtype: bool

In [20]:
df.isnull().any(axis=1) # satır satır baktı ve null var mı diye sordu

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [21]:
df[df.isnull().any(axis=1)]

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
8   P009      M     PT   NaN   14   3.0     60
10  P011      M    NaN   AWS    6   9.0    NaN

In [22]:
df.isnull().sum() # sütunlarda kaç adet null var ?

id        0
gender    0
status    1
dept      2
var1      0
var2      3
salary    3
dtype: int64

In [23]:
df.isnull().sum().sum() #  bütün veride kaç adet null var ?

9

##  Converting Improper Values to NaN Values

In [24]:
df[["var1"]]

   var1
0     2
1     3
2     5
3   nan
4     7
5     1
6   nan
7    10
8    14
9     -
10    6

In [25]:
df[["var1"]].isnull()

     var1
0   False
1   False
2   False
3   False
4   False
5   False
6   False
7   False
8   False
9   False
10  False

In [26]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [27]:
df["var1"].replace("-", np.nan) # sütun hala object type'inde

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9     NaN
10      6
Name: var1, dtype: object

In [28]:
df["var1"].replace("-", np.nan).astype(float) # burada amaç str "nan" larıda kolayca gerçek NaN çevirmek

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: var1, dtype: float64

In [29]:
df["var1"].replace("-", np.nan)

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9     NaN
10      6
Name: var1, dtype: object

In [30]:
df["var1"] = df["var1"].replace("-", np.nan).astype(float)

In [31]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M      -   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F      -    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [32]:
df["status"].replace("-", np.nan)

0      FT
1      PT
2     NaN
3      FT
4      PT
5      PT
6      FT
7     NaN
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [33]:
df["status"] = df["status"].replace("-", np.nan)

In [34]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [35]:
df0.isnull().sum().sum()

9

In [36]:
df.isnull().sum().sum()

14

# .dropna() & .drop()

In [37]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [38]:
df.dropna() # bir tane bile null varsa o satırı düşürdü

     id gender status dept  var1  var2 salary
4  P005      M     PT   DS   7.0  11.0     58

In [39]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [40]:
df.dropna(how="any") # default , bir tane bile null varsa düşür

     id gender status dept  var1  var2 salary
4  P005      M     PT   DS   7.0  11.0     58

In [41]:
df.dropna(how="all") # default , bir tane bile dolu varsa düşürme

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [42]:
df.dropna(axis= 1) # bir tane bile null varsa o sütunu düşürdü

      id gender
0   P001      M
1   P002      F
2   P003      M
3   P004      F
4   P005      M
5   P006      F
6   P007      M
7   P008      F
8   P009      M
9   P010      F
10  P011      M

In [43]:
df.dropna(thresh=6) # null olmayanlar 6 ve fazlaysa düşürme

     id gender status dept  var1  var2 salary
0  P001      M     FT   DS   2.0   8.0    NaN
1  P002      F     PT   FS   3.0   NaN     54
2  P003      M    NaN  AWS   5.0   5.0     59
3  P004      F     FT  AWS   NaN   8.0    120
4  P005      M     PT   DS   7.0  11.0     58
7  P008      F    NaN   FS  10.0   2.0    136
8  P009      M     PT  NaN  14.0   3.0     60
9  P010      F     FT   DS   NaN   7.0    125

In [44]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [45]:
df.drop(1)

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [46]:
df.drop([1, 3, 5]) # index label'ina göre düşürdü

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
2   P003      M    NaN  AWS   5.0   5.0     59
4   P005      M     PT   DS   7.0  11.0     58
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT  NaN  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [47]:
df.drop(["var1", "var2"], axis=1)

      id gender status  dept salary
0   P001      M     FT    DS    NaN
1   P002      F     PT    FS     54
2   P003      M    NaN   AWS     59
3   P004      F     FT   AWS    120
4   P005      M     PT    DS     58
5   P006      F     PT  None     75
6   P007      M     FT    FS   None
7   P008      F    NaN    FS    136
8   P009      M     PT   NaN     60
9   P010      F     FT    DS    125
10  P011      M    NaN   AWS    NaN

# .fillna()

In [48]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [49]:
df.fillna(0) # bütün nulları 0 ile doldurdu

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0       0
1   P002      F     PT   FS   3.0   0.0      54
2   P003      M      0  AWS   5.0   5.0      59
3   P004      F     FT  AWS   0.0   8.0     120
4   P005      M     PT   DS   7.0  11.0      58
5   P006      F     PT    0   1.0   0.0      75
6   P007      M     FT   FS   0.0   0.0       0
7   P008      F      0   FS  10.0   2.0     136
8   P009      M     PT    0  14.0   3.0      60
9   P010      F     FT   DS   0.0   7.0     125
10  P011      M      0  AWS   6.0   9.0       0

In [50]:
df[["var1"]].fillna(0)

    var1
0    2.0
1    3.0
2    5.0
3    0.0
4    7.0
5    1.0
6    0.0
7   10.0
8   14.0
9    0.0
10   6.0

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  8 non-null      object
 3   dept    9 non-null      object
 4   var1    8 non-null      float64
 5   var2    8 non-null      float64
 6   salary  8 non-null      object
dtypes: float64(2), object(5)
memory usage: 744.0+ bytes

In [52]:
df[["var1"]].fillna(df["var1"].mean()) # boş hücreleri o sütunun ortalamasıyla doldurduk

    var1
0    2.0
1    3.0
2    5.0
3    6.0
4    7.0
5    1.0
6    6.0
7   10.0
8   14.0
9    6.0
10   6.0

In [53]:
df.fillna(df.mean()) # sadece sayısal sğtunlara uyguladı

      id gender status  dept  var1    var2   salary
0   P001      M     FT    DS   2.0   8.000   85.875
1   P002      F     PT    FS   3.0   6.625   54.000
2   P003      M    NaN   AWS   5.0   5.000   59.000
3   P004      F     FT   AWS   6.0   8.000  120.000
4   P005      M     PT    DS   7.0  11.000   58.000
5   P006      F     PT  None   1.0   6.625   75.000
6   P007      M     FT    FS   6.0   6.625   85.875
7   P008      F    NaN    FS  10.0   2.000  136.000
8   P009      M     PT   NaN  14.0   3.000   60.000
9   P010      F     FT    DS   6.0   7.000  125.000
10  P011      M    NaN   AWS   6.0   9.000   85.875

In [54]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [55]:
df.fillna({"dept": "Other", "var1": df.var1.mean(), "var2": df.var2.median()}) 
#sözlük yapısıyla istediğimiz sütunlara istediğimiz işlemleri ayrı ayrı yaptırabildik

      id gender status   dept  var1  var2 salary
0   P001      M     FT     DS   2.0   8.0    NaN
1   P002      F     PT     FS   3.0   7.5     54
2   P003      M    NaN    AWS   5.0   5.0     59
3   P004      F     FT    AWS   6.0   8.0    120
4   P005      M     PT     DS   7.0  11.0     58
5   P006      F     PT  Other   1.0   7.5     75
6   P007      M     FT     FS   6.0   7.5   None
7   P008      F    NaN     FS  10.0   2.0    136
8   P009      M     PT  Other  14.0   3.0     60
9   P010      F     FT     DS   6.0   7.0    125
10  P011      M    NaN    AWS   6.0   9.0    NaN

In [56]:
df.dept.mode() # en çok tekrar eden eleman

0    AWS
1     DS
2     FS
Name: dept, dtype: object

In [57]:
df.dept.mode().iloc[0]

'AWS'

In [58]:
df.dept.fillna(df.dept.mode()[0])
# 0 yazdık çünkü birden fazla mode olduğu için ilkini aldık

0      DS
1      FS
2     AWS
3     AWS
4      DS
5     AWS
6      FS
7      FS
8     AWS
9      DS
10    AWS
Name: dept, dtype: object

## bfill, dfill

In [59]:
df.dept

0       DS
1       FS
2      AWS
3      AWS
4       DS
5     None
6       FS
7       FS
8      NaN
9       DS
10     AWS
Name: dept, dtype: object

In [60]:
df.dept.fillna(method="bfill") #sonraki gelen deeğerle doldur

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      FS
6      FS
7      FS
8      DS
9      DS
10    AWS
Name: dept, dtype: object

In [61]:
df.dept.fillna(method="ffill") #önceki gelen değerle doldur

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      DS
6      FS
7      FS
8      FS
9      DS
10    AWS
Name: dept, dtype: object

In [62]:
df.dept.fillna(method="ffill", inplace=True)
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M    NaN  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [63]:
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M    NaN  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [64]:
df["salary"] >= 100

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9      True
10    False
Name: salary, dtype: bool

In [65]:
df.loc[df["salary"] >= 100, "status"]

3     FT
7    NaN
9     FT
Name: status, dtype: object

In [66]:
df.loc[df["salary"] < 100, "status"]

1     PT
2    NaN
4     PT
5     PT
8     PT
Name: status, dtype: object

In [67]:
df.loc[df["salary"] >= 100, "status"].fillna(df.loc[df["salary"] >= 100, "status"].mode()[0])

3    FT
7    FT
9    FT
Name: status, dtype: object

In [68]:
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M    NaN  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [69]:
df.loc[df["salary"] >= 100, "status"] = df.loc[df["salary"] >= 100, "status"].fillna(df.loc[df["salary"] >= 100, "status"].mode()[0])

df.loc[df["salary"] < 100, "status"] = df.loc[df["salary"] < 100, "status"].fillna(df.loc[df["salary"] < 100, "status"].mode()[0])

In [70]:
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M     PT  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F     FT   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [71]:
df.groupby(["gender", "dept"])[["salary"]].median()

             salary
gender dept
F      AWS    120.0
       DS     100.0
       FS      95.0
M      AWS     59.0
       DS      58.0
       FS      60.0

In [72]:
df.status

0      FT
1      PT
2      PT
3      FT
4      PT
5      PT
6      FT
7      FT
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [73]:
df.groupby(["gender", "dept"])["status"].transform(lambda x: x.mode()[0])
# burada gender ve dept göre gruplayıp bu grubların status'unu grupların status değerlerinin mode larına eşitledik
#yani tüm grupların elemanları aynı statuse sahip oldu

0     FT
1     FT
2     PT
3     FT
4     FT
5     FT
6     FT
7     FT
8     FT
9     FT
10    PT
Name: status, dtype: object

In [74]:
df["status"].fillna(df.groupby(["gender", "dept"])["status"].transform(lambda x: x.mode()[0]), inplace=True)
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M     PT  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F     FT   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M     PT  AWS   6.0   9.0    NaN

In [75]:
df["salary"].fillna(df.groupby(["status", "dept"])["salary"].transform("mean"), inplace=True)
df

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0   125.0
1   P002      F     PT   FS   3.0   NaN    54.0
2   P003      M     PT  AWS   5.0   5.0    59.0
3   P004      F     FT  AWS   NaN   8.0   120.0
4   P005      M     PT   DS   7.0  11.0    58.0
5   P006      F     PT   DS   1.0   NaN    75.0
6   P007      M     FT   FS   NaN   NaN   136.0
7   P008      F     FT   FS  10.0   2.0   136.0
8   P009      M     PT   FS  14.0   3.0    60.0
9   P010      F     FT   DS   NaN   7.0   125.0
10  P011      M     PT  AWS   6.0   9.0    59.0

In [76]:
df["var1"].fillna(df.groupby(["gender", "status"])["var1"].transform("mean"), inplace=True)
df

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0   125.0
1   P002      F     PT   FS   3.0   NaN    54.0
2   P003      M     PT  AWS   5.0   5.0    59.0
3   P004      F     FT  AWS  10.0   8.0   120.0
4   P005      M     PT   DS   7.0  11.0    58.0
5   P006      F     PT   DS   1.0   NaN    75.0
6   P007      M     FT   FS   2.0   NaN   136.0
7   P008      F     FT   FS  10.0   2.0   136.0
8   P009      M     PT   FS  14.0   3.0    60.0
9   P010      F     FT   DS  10.0   7.0   125.0
10  P011      M     PT  AWS   6.0   9.0    59.0

In [77]:
df["var2"].fillna(df.groupby(["status"])["var2"].transform("mean"), inplace=True)
df

      id gender status dept  var1   var2  salary
0   P001      M     FT   DS   2.0   8.00   125.0
1   P002      F     PT   FS   3.0   7.00    54.0
2   P003      M     PT  AWS   5.0   5.00    59.0
3   P004      F     FT  AWS  10.0   8.00   120.0
4   P005      M     PT   DS   7.0  11.00    58.0
5   P006      F     PT   DS   1.0   7.00    75.0
6   P007      M     FT   FS   2.0   6.25   136.0
7   P008      F     FT   FS  10.0   2.00   136.0
8   P009      M     PT   FS  14.0   3.00    60.0
9   P010      F     FT   DS  10.0   7.00   125.0
10  P011      M     PT  AWS   6.0   9.00    59.0

# append() & concat() & merge() & join()

**Difference between merge, join, and concatenate;**

[Source01](https://realpython.com/pandas-merge-join-and-concat/), 
[Source02](https://studymachinelearning.com/difference-between-merge-join-and-concatenate/abs), 
[Source03](https://www.educba.com/pandas-merge-vs-join/),
[Source04](https://pandas.pydata.org/docs/user_guide/merging.html), 
[Source05](https://stackoverflow.com/questions/38256104/differences-between-merge-and-concat-in-pandas)

**append() ve concat()** ile dikey birleştirme yapabiliriz.

**concat(), join() ve merge()** ile yatay birleştirme yapabiliriz.

**append() ve concat()** ile aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

**append() ve concat()** da ortak sütun olması gerekmez.

**concat()** ile hem satır hem de sütun bazlı birleştirme yapabiliriz. Yani "axis" sadece concat() de var.

**join()** de aynı anda iki veya daha fazla dataframe i birleştirebiliriz ancak aynı sütun isimleri varsa en fazla iki df birleştirebiliriz.

**merge()** ile aynı anda iki dataframe i birleştirebiliriz.

**merge()** ile birleştirme işlemimizi ortak sütun üzerinden yapıyoruz.

In [78]:
one = pd.DataFrame({
   'name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [79]:
one

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [80]:
two

    name subject_id  marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

## append()

sadece dikey birleştirme yapabiliriz.

aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

ortak sütun olması gerekmez. ortak sütunları tanır

In [81]:
one.append(two)

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [82]:
one.append(two, ignore_index=True)

     name subject_id  marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

## concat()

hem satır hem de sütun bazlı birleştirme yapabiliriz. Yani "axis" sadece concat() de var.

aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

ortak sütun olması gerekmez. ortak sütunları tanır

In [83]:
one

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [84]:
two

    name subject_id  marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [85]:
pd.concat([one, two]) # default axis = 0

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [86]:
pd.concat([one, two], ignore_index=True)

     name subject_id  marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [87]:
pd.concat([one, two], ignore_index=True, axis=1)

        0     1   2      3     4   5
1    Alex  sub1  98  Billy  sub2  89
2     Amy  sub2  90  Brian  sub4  80
3   Allen  sub4  87   Bran  sub3  79
4   Alice  sub6  69  Bryce  sub6  97
5  Ayoung  sub5  78  Betty  sub5  88

In [88]:
pd.concat([one.iloc[ : , :2 ], two.iloc[ : , 1: ]])

     name subject_id  marks_scored
1    Alex       sub1           NaN
2     Amy       sub2           NaN
3   Allen       sub4           NaN
4   Alice       sub6           NaN
5  Ayoung       sub5           NaN
1     NaN       sub2          89.0
2     NaN       sub4          80.0
3     NaN       sub3          79.0
4     NaN       sub6          97.0
5     NaN       sub5          88.0

## merge() 

yatay birleştirme yapabiliriz.

ortak sütun olmalı. yoksa sütun eşitlemesi yapmamız gerekir

tek seferde iki dataframe i birleştirebiliriz.

birleştirme işlemimizi ortak sütun üzerinden yapıyoruz.

In [89]:
x = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})

y = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [90]:
x

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [91]:
y

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [92]:
pd.merge(x, y) #   how="inner" default değer
# on="key" default çünkü key ikisinde de var. otomatik anladı

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [93]:
pd.merge(x, y, how="outer")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [94]:
pd.merge(x, y, how="left")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [95]:
pd.merge(x, y, how="right")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [96]:
df1 = pd.DataFrame({'lkey': ['x', 'y', 'z', 'x'],
                    'lvalue': [2, 3, 5, 7]})

df2 = pd.DataFrame({'rkey': ['a', 'x', 'z', 'b'],
                    'rvalue': [7, 8, 9, 10]})

In [97]:
df1

  lkey  lvalue
0    x       2
1    y       3
2    z       5
3    x       7

In [98]:
df2

  rkey  rvalue
0    a       7
1    x       8
2    z       9
3    b      10

In [99]:
pd.merge(df1, df2, left_on="lkey", right_on="rkey")
# ortak sütun olmadığı için ikisinin ortak olmasını istediğimiz sütunları tek tek tanımlamamız gerekir

  lkey  lvalue rkey  rvalue
0    x       2    x       8
1    x       7    x       8
2    z       5    z       9

In [100]:
pd.merge(df1, df2, left_on="lkey", right_on="rkey", how="outer")

  lkey  lvalue rkey  rvalue
0    x     2.0    x     8.0
1    x     7.0    x     8.0
2    y     3.0  NaN     NaN
3    z     5.0    z     9.0
4  NaN     NaN    a     7.0
5  NaN     NaN    b    10.0

## join()

 yatay birleştirme yapabiliriz. Ortak sütun zorunluluğu yok

**join()** de aynı anda iki veya daha fazla dataframe i birleştirebiliriz ancak aynı sütun isimleri varsa en fazla iki df birleştirebiliriz.

Daha çok SQL tabanlı veri işleme işlemlerinde kullanılır. 

[Source 01](https://sparkbyexamples.com/pandas/pandas-join-explained-with-examples/), 
[Source 02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html), 
[Source 03](https://www.w3schools.com/python/pandas/ref_df_join.asp)

In [101]:
df3 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index = ['K0', 'K1', 'K2']) 

df4 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index = ['K0', 'K2', 'K3'])

In [102]:
df3

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [103]:
df4

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [104]:
df3.join(df4) # default how="left" . 3 teki satırları getirdi, 4teki ortak satırları getirdi

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [105]:
df3.join(df4, how="right")

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [106]:
df3.join(df4, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [107]:
df3.join(df4, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [108]:
df4.join(df3)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [109]:
df5 = pd.DataFrame({'key': ['K0', 'K2', 'K3', 'K4', 'K5', 'K6'],
                   'X': ['X0', 'X2', 'X3', 'X4', 'X5', 'X6']})

df6 = pd.DataFrame({'key': ['K0', 'K2', 'K3'],
                      'Y': ['Y0', 'Y2', 'Y3']})

In [110]:
df5

  key   X
0  K0  X0
1  K2  X2
2  K3  X3
3  K4  X4
4  K5  X5
5  K6  X6

In [111]:
df6

  key   Y
0  K0  Y0
1  K2  Y2
2  K3  Y3

In [112]:
#df5.join(df6) # aynı isimli sütun olduğu için çalışmaz

In [113]:
df5.join(df6, lsuffix="_5", rsuffix="_6") # bu şekilde aynı sütun isimlerini farklılaştırdık

  key_5   X key_6    Y
0    K0  X0    K0   Y0
1    K2  X2    K2   Y2
2    K3  X3    K3   Y3
3    K4  X4   NaN  NaN
4    K5  X5   NaN  NaN
5    K6  X6   NaN  NaN

In [114]:
df5.set_index("key")

      X
key
K0   X0
K2   X2
K3   X3
K4   X4
K5   X5
K6   X6

In [115]:
df6.set_index("key")

      Y
key
K0   Y0
K2   Y2
K3   Y3

In [116]:
df5.set_index("key").join(df6.set_index("key"))

      X    Y
key
K0   X0   Y0
K2   X2   Y2
K3   X3   Y3
K4   X4  NaN
K5   X5  NaN
K6   X6  NaN

# String methods
**str.lower():** Bir stringi küçük harfe dönüştürür

**str.upper():** Bir stringi büyük harfe dönüştürür

**str.capitalize():** İlk karakteri büyük harfe dönüştürür

**str.title():** Her kelimenin ilk karakterini büyük harfe dönüştürür

**str.swapcase():** Büyük harfleri küçük, küçük harfleri büyük harfe dönüştürür

**str.isalpha():** Tüm karakterlerin alfabede yer alıp almadığını kontrol ederek True veya False değeri döndürür

**str.isnumeric():** Tüm karakterlerin sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.isalnum():** Tüm karakterlerin harf veya sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.endswith():** Bir stringin belirtilen değerle bittiğini kontrol ederek True veya False değeri döndürür

**str.startswith():** Bir stringin belirtilen değerle başladığını kontrol ederek True veya False değeri döndürür

**str.contains():** Bir alt dizinin bir dizede bulunup bulunmadığını kontrol ederek her bir öğe için True veya False değeri döndürür

**str.strip():** Bir stringin başındaki ve sonundaki boşlukları temizler ve kırpılmış bir versiyonunu döndürür

**str.replace():** Belirtilen bir değeri başka bir değerle değiştirilmiş bir string döndürür

**str.split():** Bir stringi belirtilen ayraçta böler ve bir liste döndürür

**str.find():** Bir stringde belirtilen bir değeri arar ve bulunduğu konumun indeksini döndürür

**str.findall():** Bir desendeki tüm örneklerin bir listesini döndürür

**str.join():** Bir iterable ın öğelerini bir stringe dönüştürür

[SOURCE01](https://docs.python.org/3/library/stdtypes.html#string-methods),
[SOURCE02](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html),
[SOURCE03](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas),
[SOURCE04](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm) &
[Video](https://www.youtube.com/watch?v=6JNwK6hEneg)

In [117]:
df = pd.DataFrame(data=[['Tyler DURDEN', 'HR', "manager", "$180,000", 55],
                        ['MARIA puder', "IT", "data analyst", "150000dolar", 28],
                        ['dorothy gale', "HR", "recruiter", "$120,000", 30],
                        ['Edmond Dantes', "IT", "data scientist", "$170,000","-"], 
                        ['Gregor SAMSA',"IT", "frontend developer", "120000dolar",32]],
                  columns=["name","dept", "job", "sales", "age"])
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   dept    5 non-null      object
 2   job     5 non-null      object
 3   sales   5 non-null      object
 4   age     5 non-null      object
dtypes: object(5)
memory usage: 328.0+ bytes

In [119]:
df.name.str.title()

0     Tyler Durden
1      Maria Puder
2     Dorothy Gale
3    Edmond Dantes
4     Gregor Samsa
Name: name, dtype: object

In [120]:
df.name.str.capitalize()

0     Tyler durden
1      Maria puder
2     Dorothy gale
3    Edmond dantes
4     Gregor samsa
Name: name, dtype: object

In [121]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [122]:
df.job.str.isalpha()

0     True
1    False
2     True
3    False
4    False
Name: job, dtype: bool

In [123]:
df.dept.str.isalpha()

0    True
1    True
2    True
3    True
4    True
Name: dept, dtype: bool

In [124]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3    False
4      NaN
Name: age, dtype: object

In [125]:
df.age.astype(str).str.isnumeric()

0     True
1     True
2     True
3    False
4     True
Name: age, dtype: bool

In [126]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [127]:
df.job.str.contains("data")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [128]:
df[df.job.str.contains("data")]

            name dept             job        sales age
1    MARIA puder   IT    data analyst  150000dolar  28
3  Edmond Dantes   IT  data scientist     $170,000   -

In [129]:
df.sales

0       $180,000
1    150000dolar
2       $120,000
3       $170,000
4    120000dolar
Name: sales, dtype: object

In [130]:
df.sales.str.rstrip("dolar").str.lstrip("$")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: sales, dtype: object

In [131]:
df.sales.str.strip("dolar$").str.replace(",", "").astype(float)

0    180000.0
1    150000.0
2    120000.0
3    170000.0
4    120000.0
Name: sales, dtype: float64

In [132]:
df.sales = df.sales.str.strip("dolar$").str.replace(",", "").astype(float)

In [133]:
df

            name dept                 job     sales age
0   Tyler DURDEN   HR             manager  180000.0  55
1    MARIA puder   IT        data analyst  150000.0  28
2   dorothy gale   HR           recruiter  120000.0  30
3  Edmond Dantes   IT      data scientist  170000.0   -
4   Gregor SAMSA   IT  frontend developer  120000.0  32

In [134]:
df.age.replace("-", np.nan)

0    55.0
1    28.0
2    30.0
3     NaN
4    32.0
Name: age, dtype: float64

In [135]:
df.age = df.age.replace("-", np.nan)

In [136]:
df

            name dept                 job     sales   age
0   Tyler DURDEN   HR             manager  180000.0  55.0
1    MARIA puder   IT        data analyst  150000.0  28.0
2   dorothy gale   HR           recruiter  120000.0  30.0
3  Edmond Dantes   IT      data scientist  170000.0   NaN
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0

In [137]:
df.name.str.title().str.split(" ").str[0]

0      Tyler
1      Maria
2    Dorothy
3     Edmond
4     Gregor
Name: name, dtype: object

In [138]:
df.name.str.title().str.split(" ").str[1]

0    Durden
1     Puder
2      Gale
3    Dantes
4     Samsa
Name: name, dtype: object

In [139]:
df["first_name"] = df.name.str.title().str.split(" ").str[0]

In [140]:
df["last_name"] = df.name.str.title().str.split(" ").str[1]

In [141]:
df

            name dept                 job     sales   age first_name last_name
0   Tyler DURDEN   HR             manager  180000.0  55.0      Tyler    Durden
1    MARIA puder   IT        data analyst  150000.0  28.0      Maria     Puder
2   dorothy gale   HR           recruiter  120000.0  30.0    Dorothy      Gale
3  Edmond Dantes   IT      data scientist  170000.0   NaN     Edmond    Dantes
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0     Gregor     Samsa

In [142]:
df.drop("name", inplace=True, axis=1)

In [143]:
df = df[["first_name", "last_name", "dept", "job", "sales", "age"]]
df

  first_name last_name dept                 job     sales   age
0      Tyler    Durden   HR             manager  180000.0  55.0
1      Maria     Puder   IT        data analyst  150000.0  28.0
2    Dorothy      Gale   HR           recruiter  120000.0  30.0
3     Edmond    Dantes   IT      data scientist  170000.0   NaN
4     Gregor     Samsa   IT  frontend developer  120000.0  32.0

In [144]:
df.job.str.find("scient") # -1 yok demek, hangi indexte başlıyorsa onu döndürdü

0   -1
1   -1
2   -1
3    5
4   -1
Name: job, dtype: int64

In [145]:
df.job.str.findall("d")

0        []
1       [d]
2        []
3       [d]
4    [d, d]
Name: job, dtype: object

In [146]:
df.job.str.findall("d").apply(len)

0    0
1    1
2    0
3    1
4    2
Name: job, dtype: int64

In [147]:
df.job.str.findall("d").map(len)

0    0
1    1
2    0
3    1
4    2
Name: job, dtype: int64

In [148]:
df["skills"] = [[], ["Python", "Tableau", "SQL"], [], ["ML", "DL", "NLP"], ["React", "Django"]]
df["Skills"] = [[], "Python, Tableau, SQL", [], ["ML", "DL", "NLP"], ["React", "Django"]]
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],[]
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],[]
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","[ML, DL, NLP]"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","[React, Django]"

In [149]:
df.skills.str.join(",")

0
1    Python,Tableau,SQL
2
3             ML,DL,NLP
4          React,Django
Name: skills, dtype: object

In [150]:
df.Skills.str.join(",")

0
1    P,y,t,h,o,n,,, ,T,a,b,l,e,a,u,,, ,S,Q,L
2
3                                  ML,DL,NLP
4                               React,Django
Name: Skills, dtype: object

In [151]:
df.Skills.apply(lambda x: ",".join(x) if type(x) == list else x)

0
1    Python, Tableau, SQL
2
3               ML,DL,NLP
4            React,Django
Name: Skills, dtype: object

In [152]:
df.Skills = df.Skills.apply(lambda x: ",".join(x) if type(x) == list else x)
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","ML,DL,NLP"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","React,Django"

# pd.get_dummies

get_dummies(), makine öğrenimi ve veri analizinde yaygın olarak kullanılan bir işlevdir. 

Genellikle kategorik değişkenleri veya text datalarını, makine öğrenimi algoritmaları tarafından kolayca işlenebilen sayısal veya binary dönüştürmek için kullanılır.

[SOURCE01](https://www.sharpsightlabs.com/blog/pandas-get-dummies/),
[SOURCE02](https://dataindependent.com/pandas/pandas-get-dummies-pd-get_dummies/),
[SOURCE03](https://www.educative.io/answers/what-is-the-getdummies-function-in-pandas),
[SOURCE04](https://www.w3resource.com/pandas/get_dummies.php)

In [153]:
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","ML,DL,NLP"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","React,Django"

In [154]:
pd.get_dummies(df.dept)

   HR  IT
0   1   0
1   0   1
2   1   0
3   0   1
4   0   1

In [155]:
pd.get_dummies(df.dept, drop_first=True) # ilk sütunu düşürdü

   IT
0   0
1   1
2   0
3   1
4   1

In [156]:
df.Skills.str.get_dummies(sep=",")

    SQL   Tableau  DL  Django  ML  NLP  Python  React
0     0         0   0       0   0    0       0      0
1     1         1   0       0   0    0       1      0
2     0         0   0       0   0    0       0      0
3     0         0   1       0   1    1       0      0
4     0         0   0       1   0    0       0      1

In [157]:
df.Skills.str.get_dummies(sep=",").add_prefix("skills_")
# sütun isimlerine ekleme yaptık. nerden geldiğini daha iyi anlamak için

,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,0,0,0,0,0,0,0,0
1,1,1,0,0,0,0,1,0
2,0,0,0,0,0,0,0,0
3,0,0,1,0,1,1,0,0
4,0,0,0,1,0,0,0,1

In [158]:
skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("skills_")
skills_dummy

,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,0,0,0,0,0,0,0,0
1,1,1,0,0,0,0,1,0
2,0,0,0,0,0,0,0,0
3,0,0,1,0,1,1,0,0
4,0,0,0,1,0,0,0,1

In [159]:
df_final = df[["dept", "job", "sales", "Skills"]]
df_final

  dept                 job     sales                Skills
0   HR             manager  180000.0
1   IT        data analyst  150000.0  Python, Tableau, SQL
2   HR           recruiter  120000.0
3   IT      data scientist  170000.0             ML,DL,NLP
4   IT  frontend developer  120000.0          React,Django

In [160]:
df_final2 = df_final.join(skills_dummy)
df_final2

,dept,job,sales,Skills,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,HR,manager,180000.0,,0,0,0,0,0,0,0,0
1,IT,data analyst,150000.0,"Python, Tableau, SQL",1,1,0,0,0,0,1,0
2,HR,recruiter,120000.0,,0,0,0,0,0,0,0,0
3,IT,data scientist,170000.0,"ML,DL,NLP",0,0,1,0,1,1,0,0
4,IT,frontend developer,120000.0,"React,Django",0,0,0,1,0,0,0,1

In [161]:
df_final2.drop("Skills", axis=1, inplace=True)

In [162]:
df_final2

,dept,job,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,HR,manager,180000.0,0,0,0,0,0,0,0,0
1,IT,data analyst,150000.0,1,1,0,0,0,0,1,0
2,HR,recruiter,120000.0,0,0,0,0,0,0,0,0
3,IT,data scientist,170000.0,0,0,1,0,1,1,0,0
4,IT,frontend developer,120000.0,0,0,0,1,0,0,0,1

In [163]:
pd.get_dummies(df_final2, drop_first=True)

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [164]:
df_final3 = pd.get_dummies(df_final2, drop_first=True)
df_final3

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

# DataFrame Import and Export

In [165]:
df_final3

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [166]:
df_final3.to_csv("df_final3.csv")

In [167]:
pd.read_csv("df_final3.csv") # ekstra index ekledi

,Unnamed: 0,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [168]:
# pd.read_csv("df_final3.csv", index_col=0) yendiden indexlenemeden kurtulduk

## bir siteden tablo okuma

In [169]:
df = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)")
df

[                        Country / Area UN continental region[4]  \
 0                                India                     Asia
 1                             China[a]                     Asia
 2                        United States                 Americas
 3                            Indonesia                     Asia
 4                             Pakistan                     Asia
 ..                                 ...                      ...
 232        Montserrat (United Kingdom)                 Americas
 233  Falkland Islands (United Kingdom)                 Americas
 234                               Niue                  Oceania
 235              Tokelau (New Zealand)                  Oceania
 236                              World                      NaN

     UN statistical subregion[4]  Population (1 July 2022)  \
 0                 Southern Asia                1417173173
 1                  Eastern Asia                1425887337
 2              Northern America                 338289857
 3            South-eastern Asia                 275501339
 4                 Southern Asia                 235824863
 ..                          ...                       ...
 232                   Caribbean                      4390
 233               South America                      3780
 234                   Polynesia                      1934
 235                   Polynesia                      1871
 236                         NaN                7975105156

      Population (1 April 2023)  Change
 0                   1428627663  +0.81%
 1                   1425671352  −0.02%
 2                    339996564  +0.50%
 3                    277534123  +0.74%
 4                    240485658  +1.98%
 ..                         ...     ...
 232                       4387  −0.07%
 233                       3791  +0.29%
 234                       1935  +0.05%
 235                       1893  +1.18%
 236                 8045311448  +0.88%

 [237 rows x 6 columns],
    .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteLists of countries by population statistics  \
 0                                              Global
 1                               Continents/subregions
 2                                    Intercontinental
 3                                  Cities/urban areas
 4                                     Past and future
 5                                  Population density
 6                                   Growth indicators
 7                                     Life expectancy
 8                                  Other demographics
 9                                              Health
 10                           Education and innovation
 11                                           Economic
 12    List of international rankings Lists by country

    .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteLists of countries by population statistics.1
 0   Current population United Nations Demographics...
 1   Africa Antarctica Asia Europe North America Ca...
 2   Americas Arab world Commonwealth of Nations Eu...
 3   World cities National capitals Megacities Mega...
 4   Past and future population World population es...
 5   Current density Past and future population den...
 6   Population growth rate Natural increase Net re...
 7   world Africa Asia Europe North America South A...
 8   Age at childbearing Age at first marriage Age ...
 9   Antidepressant consumption Antiviral medicatio...
 10  Bloomberg Innovation Index Education Index Int...
 11  Access to financial services Development aid d...
 12    List of international rankings Lists by country                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        ]

In [170]:
table = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)")
df_country = table[0] # ilk tabloyu almış olduk
df_country

,Country / Area,UN continental region[4],UN statistical subregion[4],Population (1 July 2022),Population (1 April 2023),Change
0,India,Asia,Southern Asia,1417173173,1428627663,+0.81%
1,China[a],Asia,Eastern Asia,1425887337,1425671352,−0.02%
2,United States,Americas,Northern America,338289857,339996564,+0.50%
3,Indonesia,Asia,South-eastern Asia,275501339,277534123,+0.74%
4,Pakistan,Asia,Southern Asia,235824863,240485658,+1.98%
...,...,...,...,...,...,...
232,Montserrat (United Kingdom),Americas,Caribbean,4390,4387,−0.07%
233,Falkland Islands (United Kingdom),Americas,South America,3780,3791,+0.29%
234,Niue,Oceania,Polynesia,1934,1935,+0.05%
235,Tokelau (New Zealand),Oceania,Polynesia,1871,1893,+1.18%
236,World,NaN,NaN,7975105156,8045311448,+0.88%

In [171]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [173]:
df["entry_date"]

0      2018-12-04
1      2018-12-04
2      2018-12-04
3      2018-12-04
4      2018-12-04
          ...
906    2020-10-07
907    2020-10-07
908    2020-11-13
909    2020-11-24
910    2020-11-26
Name: entry_date, Length: 911, dtype: object

In [174]:
pd.to_datetime(df["entry_date"])

0     2018-12-04
1     2018-12-04
2     2018-12-04
3     2018-12-04
4     2018-12-04
         ...
906   2020-10-07
907   2020-10-07
908   2020-11-13
909   2020-11-24
910   2020-11-26
Name: entry_date, Length: 911, dtype: datetime64[ns]

In [175]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])
df.tail()

     id_product order_date  product_quantity  product_price entry_date
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

In [176]:
df["order_date"]

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [177]:
df["order_date"].dt.to_period("D")

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: period[D]

In [178]:
df.order_date.dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object